Revit 2024 API
BuiltInFailures.DividedPathFailures.DividedPathUpdateMergedPointKeysStepFailed Property
 Merging failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedPathUpdateMergedPointKeysStepFailed { get; }
Visual Basic
Public Shared ReadOnly Property DividedPathUpdateMergedPointKeysStepFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedPathUpdateMergedPointKeysStepFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedPathFailures Class
Autodesk.Revit.DB Namespace